In [40]:
import pandas as pd

In [41]:
df = pd.read_csv("raw_data.csv")

df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [42]:
df.isnull()
df.isna()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [43]:
df.isnull().sum()

id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64

In [44]:
df_pure_rows = df.dropna()
df_pure_rows

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
5   5      Li Wei  27.0   China    Male  51000.0
8   8  Rachel Lee  29.0     USA  Female  62000.0

In [45]:
df_pure_cols = df.dropna(axis = 1)
df_pure_cols

    id
0    1
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10

In [46]:
age_mean = df["age"].mean()

df_aged = df["age"].fillna(age_mean)

df["age"] = df_aged

df

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [47]:
income_mean = df["income"].mean()

df_income = df["income"].fillna(income_mean)

df["income"] = df_income

df

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female  57600.0
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [48]:
df.ffill()

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female  57600.0
5    5        Li Wei  27.00   China     Male  51000.0
6    6        Li Wei  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00   India     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA     Male  58000.0

In [49]:
df.duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [50]:
df = df.drop_duplicates()

df

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female  57600.0
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [51]:
df.duplicated()

0     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [52]:
df["tax_slb"] = df["income"].apply(lambda x : "20%" if x >= 50000 else "10%")

df

C:\Users\profe\AppData\Local\Temp\ipykernel_17300\1536331124.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["tax_slb"] = df["income"].apply(lambda x : "20%" if x >= 50000 else "10%")

    id          name    age country   gender   income tax_slb
0    1      John Doe  29.00     USA     Male  55000.0     20%
2    2    Jane Smith  32.75  Canada   Female  62000.0     20%
3    3          Alex  32.75     USA  Unknown  47000.0     10%
4    4  Maria Garcia  34.00   Spain   Female  57600.0     20%
5    5        Li Wei  27.00   China     Male  51000.0     20%
6    6           NaN  45.00   India   Female  73000.0     20%
7    7    Ahmed Khan  38.00     NaN     Male  68000.0     20%
8    8    Rachel Lee  29.00     USA   Female  62000.0     20%
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0     10%
10  10   Emily Davis  31.00     USA      NaN  58000.0     20%

In [53]:

gender_map = {"Male":"M" , "Female":"F" , "Unknown" : "U" ,"NaN" : "U"}

df["gender"] = df["gender"].map(gender_map)

df

C:\Users\profe\AppData\Local\Temp\ipykernel_17300\304682618.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["gender"] = df["gender"].map(gender_map)

    id          name    age country gender   income tax_slb
0    1      John Doe  29.00     USA      M  55000.0     20%
2    2    Jane Smith  32.75  Canada      F  62000.0     20%
3    3          Alex  32.75     USA      U  47000.0     10%
4    4  Maria Garcia  34.00   Spain      F  57600.0     20%
5    5        Li Wei  27.00   China      M  51000.0     20%
6    6           NaN  45.00   India      F  73000.0     20%
7    7    Ahmed Khan  38.00     NaN      M  68000.0     20%
8    8    Rachel Lee  29.00     USA      F  62000.0     20%
9    9   Carlos Ruiz  32.75  Mexico      M  45000.0     10%
10  10   Emily Davis  31.00     USA    NaN  58000.0     20%

In [65]:
df = df.assign(new_income = df["income"] * 1.3)
df

    id          name    age country gender   income tax_slb  new_income
0    1      John Doe  29.00     USA      M  55000.0     20%     71500.0
2    2    Jane Smith  32.75  Canada      F  62000.0     20%     80600.0
3    3          Alex  32.75     USA      U  47000.0     10%     61100.0
4    4  Maria Garcia  34.00   Spain      F  57600.0     20%     74880.0
5    5        Li Wei  27.00   China      M  51000.0     20%     66300.0
6    6           NaN  45.00   India      F  73000.0     20%     94900.0
7    7    Ahmed Khan  38.00     NaN      M  68000.0     20%     88400.0
8    8    Rachel Lee  29.00     USA      F  62000.0     20%     80600.0
9    9   Carlos Ruiz  32.75  Mexico      M  45000.0     10%     58500.0
10  10   Emily Davis  31.00     USA    NaN  58000.0     20%     75400.0

In [70]:
df = df.rename(columns={"income":"salary"})

In [72]:
df["salary"].sort_values()

9     45000.0
3     47000.0
5     51000.0
0     55000.0
4     57600.0
10    58000.0
2     62000.0
8     62000.0
7     68000.0
6     73000.0
Name: salary, dtype: float64

In [75]:
df.sort_values(["salary","age"])

    id          name    age country gender   salary tax_slb  new_income
9    9   Carlos Ruiz  32.75  Mexico      M  45000.0     10%     58500.0
3    3          Alex  32.75     USA      U  47000.0     10%     61100.0
5    5        Li Wei  27.00   China      M  51000.0     20%     66300.0
0    1      John Doe  29.00     USA      M  55000.0     20%     71500.0
4    4  Maria Garcia  34.00   Spain      F  57600.0     20%     74880.0
10  10   Emily Davis  31.00     USA    NaN  58000.0     20%     75400.0
8    8    Rachel Lee  29.00     USA      F  62000.0     20%     80600.0
2    2    Jane Smith  32.75  Canada      F  62000.0     20%     80600.0
7    7    Ahmed Khan  38.00     NaN      M  68000.0     20%     88400.0
6    6           NaN  45.00   India      F  73000.0     20%     94900.0

In [73]:
df.sort_index()

    id          name    age country gender   salary tax_slb  new_income
0    1      John Doe  29.00     USA      M  55000.0     20%     71500.0
2    2    Jane Smith  32.75  Canada      F  62000.0     20%     80600.0
3    3          Alex  32.75     USA      U  47000.0     10%     61100.0
4    4  Maria Garcia  34.00   Spain      F  57600.0     20%     74880.0
5    5        Li Wei  27.00   China      M  51000.0     20%     66300.0
6    6           NaN  45.00   India      F  73000.0     20%     94900.0
7    7    Ahmed Khan  38.00     NaN      M  68000.0     20%     88400.0
8    8    Rachel Lee  29.00     USA      F  62000.0     20%     80600.0
9    9   Carlos Ruiz  32.75  Mexico      M  45000.0     10%     58500.0
10  10   Emily Davis  31.00     USA    NaN  58000.0     20%     75400.0

In [81]:
df = df.assign(salary_rank = df["salary"].rank())

In [87]:
df.sort_values("salary_rank", ascending = False)

,id,name,age,country,gender,salary,tax_slb,new_income,salary_rank
6,6,NaN,45.00,India,F,73000.0,20%,94900.0,10.0
7,7,Ahmed Khan,38.00,NaN,M,68000.0,20%,88400.0,9.0
2,2,Jane Smith,32.75,Canada,F,62000.0,20%,80600.0,7.5
8,8,Rachel Lee,29.00,USA,F,62000.0,20%,80600.0,7.5
10,10,Emily Davis,31.00,USA,NaN,58000.0,20%,75400.0,6.0
4,4,Maria Garcia,34.00,Spain,F,57600.0,20%,74880.0,5.0
0,1,John Doe,29.00,USA,M,55000.0,20%,71500.0,4.0
5,5,Li Wei,27.00,China,M,51000.0,20%,66300.0,3.0
3,3,Alex,32.75,USA,U,47000.0,10%,61100.0,2.0
9,9,Carlos Ruiz,32.75,Mexico,M,45000.0,10%,58500.0,1.0

In [92]:

df.to_csv("changed_data.csv")

In [96]:
df.groupby("country")["salary"].mean()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain     57600.0
USA       55500.0
Name: salary, dtype: float64

In [99]:
df.groupby("country")["salary"].agg(["mean","min","max","sum"])

            mean      min      max       sum
country
Canada   62000.0  62000.0  62000.0   62000.0
China    51000.0  51000.0  51000.0   51000.0
India    73000.0  73000.0  73000.0   73000.0
Mexico   45000.0  45000.0  45000.0   45000.0
Spain    57600.0  57600.0  57600.0   57600.0
USA      55500.0  47000.0  62000.0  222000.0